app/controllers/posts_controller.rb

INSERT INTO `posts` (`content`, `created_at`, `name`, `title`, `updated_at`) VALUES ('A few days ago the Linux Foundation announced the 5 finalists for its 2012 T-Shirt contest. I’m sponsoring my fiancèe’s work, titled “Freedom lifts us up”, which you can preview below. In her own words “The concept behind my design is quite simple: linux and its freedom power many aspects of our lives most people don’t know: Nasa (shuttle), US Navy (submarine), Toyota (car), US Airways (plane) and Pixar – Disney (cinema) all make use of Linux in their bu', '2013-02-26 18:13:47', ' 1 2 3 4 5 Previous Next Vote for Linux Foundation contest finalists', ' 1 2 3 4 5 Previous Next Vote for Linux Foundation contest finalists', '2013-02-26 18:13:47')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save